[
  {
    "first": "James",
    "last": "Allen",
    "middle": "F.",
    "website": "https://www.cs.rochester.edu/people/faculty/allen_james/index.html",
    "pubs": []
  },
  {
    "first": "Zhen",
    "last": "Bai",
    "middle": "",
    "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html",
    "pubs": [
      {
        "author": "Zhen Bai",
        "title": "Using augmented reality to elicit pretend play for children with autism",
        "abstract": "Children with autism spectrum condition (ASC) suffer from deficits or developmental delays in symbolic thinking. In particular, they are often found lacking in pretend play during early childhood. Researchers believe that they encounter difficulty in generating and maintaining mental representation of pretense coupled with the immediate reality. We have developed an interactive system that explores the potential of Augmented Reality (AR) technology to visually conceptualize the representation of pretense within an open-ended play environment. Results from an empirical study involving children with ASC aged 4 to 7 demonstrated a significant improvement of pretend play in terms of frequency, duration and relevance using the AR system in comparison to a non computer-assisted situation. We investigated individual differences, skill transfer, system usability and limitations of the proposed AR system. We discuss …",
        "url": "https://ieeexplore.ieee.org/abstract/document/7000596/",
        "pub_year": 2015
      },
      {
        "author": "Zhen Bai",
        "title": "SmileyCluster: supporting accessible machine learning in K-12 scientific discovery",
        "abstract": "There is an increasing need to prepare young learners to be Artificial Intelligence (AI) capable for the future workforce and everyday life. Machine Learning (ML), as an integral subfield of AI, has become the new engine that revolutionizes practices of knowledge discovery. Making ML experience accessible to young learners, however, remains challenging due to its high demand for mathematical and computational skills. This research focuses on designing novel learning environments that help demystify ML technologies for K-12 students, and also investigating new opportunities for maximizing ML accessibility through integration with scientific discovery in STEM education. We developed SmileyCluster - a hands-on and collaborative learning environment that utilizes glyph-based data visualization and superposition comparative visualization to assist learning an entry-level ML technology, namely k-means …",
        "url": "https://dl.acm.org/doi/abs/10.1145/3392063.3394440",
        "pub_year": 2020
      },
      {
        "author": "Zhen Bai",
        "title": "Through the looking glass: Pretend play for children with autism",
        "abstract": "Lack of spontaneous pretend play is an early diagnostic indicator of autism spectrum conditions (ASC) along with impaired communication and social interaction. In a previous ISMAR poster [2] we proposed an Augmented Reality (AR) system to encourage pretend play, based on an analogy between imaginative interpretation of physical objects (pretense) and the superimposition of virtual content on the physical world in AR. This paper reports an empirical experiment evaluating that proposal, involving children between the ages of 4 and 7 who have been diagnosed with ASC. Results find significantly more pretend play, and higher engagement, using the AR system by comparison to a non-augmented condition. We also discuss usability issues and design implications for AR systems that aim to support children with ASC and other pervasive developmental disorders.",
        "url": "https://ieeexplore.ieee.org/abstract/document/6671763/",
        "pub_year": 2013
      }
    ]
  },
  {
    "first": "Christopher",
    "last": "Brown",
    "middle": "M.",
    "website": "https://www.cs.rochester.edu/people/faculty/brown_christopher/index.html",
    "pubs": []
  }
]