[
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "Using augmented reality to elicit pretend play for children with autism",
    "abstract": "Children with autism spectrum condition (ASC) suffer from deficits or developmental delays in symbolic thinking. In particular, they are often found lacking in pretend play during early childhood. Researchers believe that they encounter difficulty in generating and maintaining mental representation of pretense coupled with the immediate reality. We have developed an interactive system that explores the potential of Augmented Reality (AR) technology to visually conceptualize the representation of pretense within an open-ended play environment. Results from an empirical study involving children with ASC aged 4 to 7 demonstrated a significant improvement of pretend play in terms of frequency, duration and relevance using the AR system in comparison to a non computer-assisted situation. We investigated individual differences, skill transfer, system usability and limitations of the proposed AR system. We discuss …",
    "url": "https://ieeexplore.ieee.org/abstract/document/7000596/",
    "pub_year": 2015
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "SmileyCluster: supporting accessible machine learning in K-12 scientific discovery",
    "abstract": "There is an increasing need to prepare young learners to be Artificial Intelligence (AI) capable for the future workforce and everyday life. Machine Learning (ML), as an integral subfield of AI, has become the new engine that revolutionizes practices of knowledge discovery. Making ML experience accessible to young learners, however, remains challenging due to its high demand for mathematical and computational skills. This research focuses on designing novel learning environments that help demystify ML technologies for K-12 students, and also investigating new opportunities for maximizing ML accessibility through integration with scientific discovery in STEM education. We developed SmileyCluster - a hands-on and collaborative learning environment that utilizes glyph-based data visualization and superposition comparative visualization to assist learning an entry-level ML technology, namely k-means …",
    "url": "https://dl.acm.org/doi/abs/10.1145/3392063.3394440",
    "pub_year": 2020
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "Through the looking glass: Pretend play for children with autism",
    "abstract": "Lack of spontaneous pretend play is an early diagnostic indicator of autism spectrum conditions (ASC) along with impaired communication and social interaction. In a previous ISMAR poster [2] we proposed an Augmented Reality (AR) system to encourage pretend play, based on an analogy between imaginative interpretation of physical objects (pretense) and the superimposition of virtual content on the physical world in AR. This paper reports an empirical experiment evaluating that proposal, involving children between the ages of 4 and 7 who have been diagnosed with ASC. Results find significantly more pretend play, and higher engagement, using the AR system by comparison to a non-augmented condition. We also discuss usability issues and design implications for AR systems that aim to support children with ASC and other pervasive developmental disorders.",
    "url": "https://ieeexplore.ieee.org/abstract/document/6671763/",
    "pub_year": 2013
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "Analytic review of usability evaluation in ISMAR",
    "abstract": "There has been a rapid increase in research evaluating usability of Augmented Reality (AR) systems in recent years. Although many different styles of evaluation are used, there is no clear consensus on the most relevant approaches. We report a review of papers published in International Symposium of Mixed and Augmented Reality (ISMAR) proceedings in the past decade, building on the previous work of Swan and Gabbard (2005). Firstly, we investigate the evaluation goal, measurement and method of ISMAR papers according to their usability research in four categories: performance, perception and cognition, collaboration and User Experience (UX). Secondly, we consider the balance of evaluation approaches with regard to empirical–analytical, quantitative–qualitative and participant demographics. Finally we identify potential emphases for usability study of AR systems in the future. These analyses …",
    "url": "https://academic.oup.com/iwc/article-abstract/24/6/450/744624",
    "pub_year": 2012
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "Exploring expressive augmented reality: The FingAR puppet system for social pretend play",
    "abstract": "We present \"FingAR Puppet\", an Augmented Reality (AR) system enhancing social pretend play by young children. Unlike goal-oriented AR systems that augment reality with informative instructions, FingAR Puppet helps children associate expressive interpretations with immediate reality. Empirical results show that FingAR Puppet promotes reasoning about emotional states, communication and divergent thinking during social pretend play for children 4-6 years old. We suggest that this study opens an interesting space for future AR systems to support complex cognitive and social development in early childhood. We also identify broader implications from using theories of cognitive development to guide the design of tangible and augmented interactions.",
    "url": "https://dl.acm.org/doi/abs/10.1145/2702123.2702250",
    "pub_year": 2015
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "A new theoretical framework for curiosity for learning in social contexts",
    "abstract": "Curiosity is a vital metacognitive skill in educational contexts. Yet, little is known about how social factors influence curiosity in group work. We argue that curiosity is evoked not only through individual, but also interpersonal activities, and present what we believe to be the first theoretical framework that articulates an integrated socio-cognitive account of curiosity based on literature spanning psychology, learning sciences and group dynamics, along with empirical observation of small-group science activity in an informal learning environment. We make a bipartite distinction between individual and interpersonal functions that contribute to curiosity, and multimodal behaviors that fulfill these functions. We validate the proposed framework by leveraging a longitudinal latent variable modeling approach. Findings confirm positive predictive relationship of the latent variables of individual and interpersonal …",
    "url": "https://link.springer.com/chapter/10.1007/978-3-319-66610-5_19",
    "pub_year": 2017
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "Making Pretense Visible and Graspable: An augmented reality approach to promote pretend play",
    "abstract": "Children with autism are often found to lack facility for pretend play. It is believed that this deficit is linked to linguistic, social and creativity competencies in autism. We observe that both Augmented Reality (AR) and pretend play involve processing of information that is coupled with real scenes while not necessarily being directly perceived. This research therefore examines the potential of using AR technologies to promote pretend play behaviors in children with autism. As an initial outcome, we present the design and implementation of an AR system that aims to enhance the comprehension and flexibility of object substitution during pretend play.",
    "url": "https://ieeexplore.ieee.org/abstract/document/6402567/",
    "pub_year": 2012
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "Predicting the temporal and social dynamics of curiosity in small group learning",
    "abstract": "Curiosity is an intrinsic motivation for learning, but is highly dynamic and changes moment to moment in response to environmental stimuli. In spite of the prevalence of small group learning in and outside of modern classrooms, little is known about the social nature of curiosity. In this paper, we present a model that predicts the temporal and social dynamics of curiosity based on sequences of behaviors exhibited by individuals engaged in group learning. This model reveals distinct sequential behavior patterns that predict increase and decrease of curiosity in individuals, and convergence to high and low curiosity among group members. In particular, convergence of the entire group to a state of high curiosity is highly correlated with sequences of behaviors that involve the most social of group behaviors - such as questions and answers, arguments and sharing findings, as well as scientific reasoning …",
    "url": "https://link.springer.com/chapter/10.1007/978-3-319-93843-1_31",
    "pub_year": 2018
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "Augmenting imagination for children with autism",
    "abstract": "Evidence shows that children with autism suffer a deficit in spontaneous pretend play, which is believed to have developmental links to key competences of their future lives such as creativity and social interaction. In my PhD thesis, I would like to examine the use of Augmented Reality (AR), which superimposes imaginary objects on the real scene, as a novel therapeutic approach that may encourage children with autism to be involved in pretend play. In this paper, we present the design of an interactive AR system as an entry point to explore the main research questions of the thesis.",
    "url": "https://dl.acm.org/doi/abs/10.1145/2307096.2307159",
    "pub_year": 2012
  },
  {
    "author": {
      "first": "Zhen",
      "last": "Bai",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/bai-zhen/index.html"
    },
    "title": "“Now, I want to teach it for real!”: Introducing machine learning as a scientific discovery tool for K-12 teachers",
    "abstract": "Machine Learning (ML) is a powerful tool to unveil hidden patterns in data, unearth new insights and promote scientific discovery (SD). However, expertise is usually required to actualize the potential of ML fully. Very little has been done to begin instructing the youth of society in ML, nor utilize ML as an SD tool for the K-12 age range. This research proposes SmileyDiscovery, an ML-empowered learning environment that facilitates SD for K-12 students and teachers. We conducted a 2-session preliminary study with 18 K-12 STEM teachers. Findings confirm the effectiveness of SmileyDiscovery in supporting teachers to (1) carry out ML-empowered SD, (2) design their own curriculum-aligned SD lesson plans, and (3) simultaneously obtain a rapid understanding of k-means clustering. Design implications distilled from our study can be applied to foster more effective learning support in future systems.",
    "url": "https://link.springer.com/chapter/10.1007/978-3-030-78292-4_39",
    "pub_year": 2021
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "A sparse signal reconstruction perspective for source localization with sensor arrays",
    "abstract": "We present a source localization method based on a sparse representation of sensor measurements with an overcomplete basis composed of samples from the array manifold. We enforce sparsity by imposing penalties based on the /spl lscr//sub 1/-norm. A number of recent theoretical results on sparsifying properties of /spl lscr//sub 1/ penalties justify this choice. Explicitly enforcing the sparsity of the representation is motivated by a desire to obtain a sharp estimate of the spatial spectrum that exhibits super-resolution. We propose to use the singular value decomposition (SVD) of the data matrix to summarize multiple time or frequency samples. Our formulation leads to an optimization problem, which we solve efficiently in a second-order cone (SOC) programming framework by an interior point implementation. We propose a grid refinement method to mitigate the effects of limiting estimates to a grid of spatial …",
    "url": "https://ieeexplore.ieee.org/abstract/document/1468495/",
    "pub_year": 2005
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "Sparsity and compressed sensing in radar imaging",
    "abstract": "Remote sensing with radar is typically an ill-posed linear inverse problem: a scene is to be inferred from limited measurements of scattered electric fields. Parsimonious models provide a compressed representation of the unknown scene and offer a means for regularizing the inversion task. The emerging field of compressed sensing combines nonlinear reconstruction algorithms and pseudorandom linear measurements to provide reconstruction guarantees for sparse solutions to linear inverse problems. This paper surveys the use of sparse reconstruction algorithms and randomized measurement strategies in radar processing. Although the two themes have a long history in radar literature, the accessible framework provided by compressed sensing illuminates the impact of joining these themes. Potential future directions are conjectured both for extension of theory motivated by practice and for modification of …",
    "url": "https://ieeexplore.ieee.org/abstract/document/5420035/",
    "pub_year": 2010
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "Feature-enhanced synthetic aperture radar image formation based on nonquadratic regularization",
    "abstract": "We develop a method for the formation of spotlight-mode synthetic aperture radar (SAR) images with enhanced features. The approach is based on a regularized reconstruction of the scattering field which combines a tomographic model of the SAR observation process with prior information regarding the nature of the features of interest. Compared to conventional SAR techniques, the method we propose produces images with increased resolution, reduced sidelobes, reduced speckle and easier-to-segment regions. Our technique effectively deals with the complex-valued, random-phase nature of the underlying SAR reflectivities. An efficient and robust numerical solution is achieved through extensions of half-quadratic regularization methods to the complex-valued SAR problem. We demonstrate the performance of the method on synthetic and real SAR scenes.",
    "url": "https://ieeexplore.ieee.org/abstract/document/913596/",
    "pub_year": 2001
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "Evaluation of vegetable based cutting fluids with extreme pressure and cutting parameters in turning of AISI 304L by Taguchi method",
    "abstract": "Many problems such as health and environment issues are identified with the use of cutting fluids (CFs). There has been a high demand for developing new environmentally friendly CFs such as vegetable based cutting fluids (VBCFs) to reduce these harmful effects. In this study, performances of six CFs, four different VBCFs from sunflower and canola oils with different ratios of extreme pressure (EP) additives, and two commercial types of CFs (semi-synthetic and mineral) are evaluated for reducing of surface roughness, and cutting and feed forces during turning of AISI 304L austenitic stainless steel with carbide insert tool. Taguchi’s mixed level parameter design (L18) is used for the experimental design. Cutting fluid, spindle speed, feed rate and depth of cut are considered as machining parameters. Regression analyses are applied to predict surface roughness, and cutting and feed forces. ANOVA is used to …",
    "url": "https://www.sciencedirect.com/science/article/pii/S095965261100254X",
    "pub_year": 2011
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "A nonparametric statistical method for image segmentation using information theory and curve evolution",
    "abstract": "In this paper, we present a new information-theoretic approach to image segmentation. We cast the segmentation problem as the maximization of the mutual information between the region labels and the image pixel intensities, subject to a constraint on the total length of the region boundaries. We assume that the probability densities associated with the image pixel intensities within each region are completely unknown a priori, and we formulate the problem based on nonparametric density estimates. Due to the nonparametric structure, our method does not require the image regions to have a particular type of probability distribution and does not require the extraction and use of a particular statistic. We solve the information-theoretic optimization problem by deriving the associated gradient flows and applying curve evolution techniques. We use level-set methods to implement the resulting evolution. The …",
    "url": "https://ieeexplore.ieee.org/abstract/document/1510684/",
    "pub_year": 2005
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "Homotopy continuation for sparse signal representation",
    "abstract": "We explore the application of a homotopy continuation-based method for sparse signal representation in overcomplete dictionaries. Our problem setup is based on the basis pursuit framework, which involves a convex optimization problem consisting of terms enforcing data fidelity and sparsity, balanced by a regularization parameter. Choosing a good regularization parameter in this framework is a challenging task. We describe a homotopy continuation-based algorithm to find and trace efficiently all solutions of basis pursuit as a function of the regularization parameter. In addition to providing an attractive alternative to existing optimization methods for solving the basis pursuit problem, this algorithm can also be used to provide an automatic choice for the regularization parameter, based on prior information about the desired number of non-zero components in the sparse representation. Our numerical examples …",
    "url": "https://ieeexplore.ieee.org/abstract/document/1416408/",
    "pub_year": 2005
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "A fast algorithm for vision-based hand gesture recognition for robot control",
    "abstract": "We propose a fast algorithm for automatically recognizing a limited set of gestures from hand images for a robot control application. Hand gesture recognition is a challenging problem in its general form. We consider a fixed set of manual commands and a reasonably structured environment, and develop a simple, yet effective, procedure for gesture recognition. Our approach contains steps for segmenting the hand region, locating the fingers, and finally classifying the gesture. The algorithm is invariant to translation, rotation, and scale of the hand. We demonstrate the effectiveness of the technique on real imagery.",
    "url": "https://ieeexplore.ieee.org/abstract/document/1659822/",
    "pub_year": 2006
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "Sparsity-driven synthetic aperture radar imaging: Reconstruction, autofocusing, moving targets, and compressed sensing",
    "abstract": "This article presents a survey of recent research on sparsity-driven synthetic aperture radar (SAR) imaging. In particular, it reviews 1) the analysis and synthesis-based sparse signal representation formulations for SAR image formation together with the associated imaging results, 2) sparsity-based methods for wide-angle SAR imaging and anisotropy characterization, 3) sparsity-based methods for joint imaging and autofocusing from data with phase errors, 4) techniques for exploiting sparsity for SAR imaging of scenes containing moving objects, and 5) recent work on compressed sensing (CS)-based analysis and design of SAR sensing missions.",
    "url": "https://ieeexplore.ieee.org/abstract/document/6832835/",
    "pub_year": 2014
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "Drowsy driver detection through facial movement analysis",
    "abstract": "The advance of computing technology has provided the means for building intelligent vehicle systems. Drowsy driver detection system is one of the potential applications of intelligent vehicle systems. Previous approaches to drowsiness detection primarily make pre-assumptions about the relevant behavior, focusing on blink rate, eye closure, and yawning. Here we employ machine learning to datamine actual human behavior during drowsiness episodes. Automatic classifiers for 30 facial actions from the Facial Action Coding system were developed using machine learning on a separate database of spontaneous expressions. These facial actions include blinking and yawn motions, as well as a number of other facial movements. In addition, head motion was collected through automatic eye tracking and an accelerometer. These measures were passed to learning-based classifiers such as Adaboost and …",
    "url": "https://link.springer.com/chapter/10.1007/978-3-540-75773-3_2",
    "pub_year": 2007
  },
  {
    "author": {
      "first": "Mujdat",
      "last": "Cetin",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/cetin_mujdat/index.html"
    },
    "title": "Distributed fusion in sensor networks",
    "abstract": "This paper presents an overview of research conducted to bridge the rich field of graphical models with the emerging field of data fusion for sensor networks. Both theoretical issues and prototyping applications are discussed in addition to suggesting new lines of reasoning.",
    "url": "https://ieeexplore.ieee.org/abstract/document/1657816/",
    "pub_year": 2006
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "A predictable execution model for COTS-based embedded systems",
    "abstract": "Building safety-critical real-time systems out of inexpensive, non-real-time, COTS components is challenging. Although COTS components generally offer high performance, they can occasionally incur significant timing delays. To prevent this, we propose controlling the operating point of each shared resource (like the cache, memory, and interconnection buses) to maintain it below its saturation limit. This is necessary because the low-level arbiters of these shared resources are not typically designed to provide real-time guarantees. In this work, we introduce a novel system execution model, the Predictable Execution Model (PREM), which, in contrast to the standard COTS execution model, coschedules at a high level all active components in the system, such as CPU cores and I/O peripherals. In order to permit predictable, system-wide execution, we argue that real-time embedded applications should be compiled …",
    "url": "https://ieeexplore.ieee.org/abstract/document/5767117/",
    "pub_year": 2011
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "KCoFI: Complete control-flow integrity for commodity operating system kernels",
    "abstract": "We present a new system, KCoFI, that is the first we know of to provide complete Control-Flow Integrity protection for commodity operating systems without using heavyweight complete memory safety. Unlike previous systems, KCoFI protects commodity operating systems from classical control-flow hijack attacks, return-to-user attacks, and code segment modification attacks. We formally verify a subset of KCoFI's design by modeling several features in small-step semantics and providing a partial proof that the semantics maintain control-flow integrity. The model and proof account for operations such as page table management, trap handlers, context switching, and signal delivery. Our evaluation shows that KCoFI prevents all the gadgets found by an open-source Return Oriented Programming (ROP) gadget-finding tool in the FreeBSD kernel from being used, it also reduces the number of indirect control-flow targets …",
    "url": "https://ieeexplore.ieee.org/abstract/document/6956571/",
    "pub_year": 2014
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "Secure virtual architecture: A safe execution environment for commodity operating systems",
    "abstract": "This paper describes an efficient and robust approach to provide a safe execution environment for an entire operating system, such as Linux, and all its applications. The approach, which we call Secure Virtual Architecture (SVA), defines a virtual, low-level, typed instruction set suitable for executing all code on a system, including kernel and application code. SVA code is translated for execution by a virtual machine transparently, offline or online. SVA aims to enforce fine-grained (object level) memory safety, control-flow integrity, type safety for a subset of objects, and sound analysis. A virtual machine implementing SVA achieves these goals by using a novel approach that exploits properties of existing memory pools in the kernel and by preserving the kernel's explicit control over memory, including custom allocators and explicit deallocation. Furthermore, the safety properties can be encoded compactly as …",
    "url": "https://dl.acm.org/doi/abs/10.1145/1294261.1294295",
    "pub_year": 2007
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "Virtual ghost: Protecting applications from hostile operating systems",
    "abstract": "Applications that process sensitive data can be carefully designed and validated to be difficult to attack, but they are usually run on monolithic, commodity operating systems, which may be less secure. An OS compromise gives the attacker complete access to all of an application's data, regardless of how well the application is built. We propose a new system, Virtual Ghost, that protects applications from a compromised or even hostile OS. Virtual Ghost is the first system to do so by combining compiler instrumentation and run-time checks on operating system code, which it uses to create ghost memory that the operating system cannot read or write. Virtual Ghost interposes a thin hardware abstraction layer between the kernel and the hardware that provides a set of operations that the kernel must use to manipulate hardware, and provides a few trusted services for secure applications such as ghost memory …",
    "url": "https://dl.acm.org/doi/abs/10.1145/2654822.2541986",
    "pub_year": 2014
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "Nested kernel: An operating system architecture for intra-kernel privilege separation",
    "abstract": "Monolithic operating system designs undermine the security of computing systems by allowing single exploits anywhere in the kernel to enjoy full supervisor privilege. The nested kernel operating system architecture addresses this problem by \"nesting\" a small isolated kernel within a traditional monolithic kernel. The \"nested kernel\" interposes on all updates to virtual memory translations to assert protections on physical memory, thus significantly reducing the trusted computing base for memory access control enforcement. We incorporated the nested kernel architecture into FreeBSD on x86-64 hardware while allowing the entire operating system, including untrusted components, to operate at the highest hardware privilege level by write-protecting MMU translations and de-privileging the untrusted part of the kernel. Our implementation inherently enforces kernel code integrity while still allowing dynamically loaded …",
    "url": "https://dl.acm.org/doi/abs/10.1145/2694344.2694386",
    "pub_year": 2015
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "Hodor:{Intra-Process} isolation for {High-Throughput} data plane libraries",
    "abstract": "As network, I/O, accelerator, and NVM devices capable of a million operations per second make their way into data centers, the software stack managing such devices has been shifting from implementations within the operating system kernel to more specialized kernel-bypass approaches. While the in-kernel approach guarantees safety and provides resource multiplexing, it imposes too much overhead on microsecond-scale tasks. Kernel-bypass approaches improve throughput substantially but sacrifice safety and complicate resource management: if applications are mutually distrusting, then either each application must have exclusive access to its own device or else the device itself must implement resource management.",
    "url": "https://www.usenix.org/conference/atc19/presentation/hedayati-hodor",
    "pub_year": 2019
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "Using likely invariants for automated software fault localization",
    "abstract": "We propose an automatic diagnosis technique for isolating the root cause(s) of software failures. We use likely program invariants, automatically generated using correct inputs that are close to the fault-triggering input, to select a set of candidate program locations which are possible root causes. We then trim the set of candidate root causes using software-implemented dynamic backwards slicing, plus two new filtering heuristics: dependence filtering, and filtering via multiple failing inputs that are also close to the failing input. Experimental results on reported software bugs of three large open-source servers show that we are able to narrow down the number of candidate bug locations to between 5 and 17 program expressions, even in programs that are hundreds of thousands of lines long.",
    "url": "https://dl.acm.org/doi/abs/10.1145/2451116.2451131",
    "pub_year": 2013
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "An empirical study of reported bugs in server software with implications for automated bug diagnosis",
    "abstract": "Reproducing bug symptoms is a prerequisite for performing automatic bug diagnosis. Do bugs have characteristics that ease or hinder automatic bug diagnosis? In this paper, we conduct a thorough empirical study of several key characteristics of bugs that affect reproducibility at the production site. We examine randomly selected bug reports of six server applications and consider their implications on automatic bug diagnosis tools. Our results are promising. From the study, we find that nearly 82% of bug symptoms can be reproduced deterministically by re-running with the same set of inputs at the production site. We further find that very few input requests are needed to reproduce most failures; in fact, just one input request after session establishment suffices to reproduce the failure in nearly 77% of the cases. We describe the implications of the results on reproducing software failures and designing automated …",
    "url": "https://dl.acm.org/doi/abs/10.1145/1806799.1806870",
    "pub_year": 2010
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "Silhouette: Efficient protected shadow stacks for embedded systems",
    "abstract": "Microcontroller-based embedded systems are increasingly used for applications that can have serious and immediate consequences if compromised—including automobile control systems, smart locks, drones, and implantable medical devices. Due to resource and execution-time constraints, C is the primary language used for programming these devices. Unfortunately, C is neither type-safe nor memory-safe, and control-flow hijacking remains a prevalent threat.",
    "url": "https://www.usenix.org/conference/usenixsecurity20/presentation/zhou-jie",
    "pub_year": 2020
  },
  {
    "author": {
      "first": "John",
      "last": "Criswell",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/criswell_john/index.html"
    },
    "title": "Memory Safety for Low-Level Software/Hardware Interactions.",
    "abstract": "Systems that enforce memory safety for today’s operating system kernels and other system software do not account for the behavior of low-level software/hardware interactions such as memory-mapped I/O, MMU configuration, and context switching. Bugs in such low-level interactions can lead to violations of the memory safety guarantees provided by a safe execution environment and can lead to exploitable vulnerabilities in system software. In this work, we present a set of program analysis and run-time instrumentation techniques that ensure that errors in these low-level operations do not violate the assumptions made by a safety checking system. Our design introduces a small set of abstractions and interfaces for manipulating processor state, kernel stacks, memory mapped I/O objects, MMU mappings, and self modifying code to achieve this goal, without moving resource allocation and management decisions out of the kernel. We have added these techniques to a compiler-based virtual machine called Secure Virtual Architecture (SVA), to which the standard Linux kernel has been ported previously. Our design changes to SVA required only an additional 100 lines of code to be changed in this kernel. Our experimental results show that our techniques prevent reported memory safety violations due to low-level Linux operations and that these violations are not prevented by SVA without our techniques. Moreover, the new techniques in this paper introduce very little overhead over and above the existing overheads of SVA. Taken together, these results indicate that it is clearly worthwhile to add these techniques to an existing memory safety system.",
    "url": "https://www.usenix.org/event/sec09/tech/full_papers/criswell.pdf",
    "pub_year": 2009
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "Predicting whole-program locality through reuse distance analysis",
    "abstract": "Profiling can accurately analyze program behavior for select data inputs. We show that profiling can also predict program locality for inputs other than profiled ones. Here locality is defined by the distance of data reuse. Studying whole-program data reuse may reveal global patterns not apparent in short-distance reuses or local control flow. However, the analysis must meet two requirements to be useful. The first is efficiency. It needs to analyze all accesses to all data elements in full-size benchmarks and to measure distance of any length and in any required precision. The second is predication. Based on a few training runs, it needs to classify patterns as regular and irregular and, for regular ones, it should predict their (changing) behavior for other inputs. In this paper, we show that these goals are attainable through three techniques: approximate analysis of reuse distance (originally called LRU stack distance …",
    "url": "https://dl.acm.org/doi/abs/10.1145/781131.781159",
    "pub_year": 2003
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "Quantifying the cost of context switch",
    "abstract": "Measuring the indirect cost of context switch is a challenging problem. In this paper, we show our results of experimentally quantifying the indirect cost of context switch using a synthetic workload. Specifically, we measure the impact of program data size and access stride on context switch cost. We also demonstrate the potential impact of OS background interrupt handling on the measurement accuracy. Such impact can be alleviated by using a multi-processor system on which one processor is employed for context switch measurement while the other runs OS background tasks.",
    "url": "https://dl.acm.org/doi/abs/10.1145/1281700.1281702",
    "pub_year": 2007
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "Improving cache performance of dynamic applications with computation and data layout transformations",
    "abstract": "Improving cache performance of dynamic applications with computation and data layout \ntransformations | CiNii Research CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 詳細へ\n移動 検索フォームへ移動 論文・データをさがす 大学図書館の本をさがす 日本の博士論文をさがす \nEnglish 検索 タイトル 人物/団体名 所属機関 ISSN DOI 期間 ~ 本文リンク 本文リンクあり データ\nソース JaLC IRDB Crossref DataCite NDL NDL-Digital RUDA JDCat NINJAL CiNii Articles CiNii \nBooks CiNii Dissertations DBpedia Nikkei BP KAKEN Integbio MDR PubMed LSDB Archive \n公共データカタログ ムーンショット型研究開発事業 すべて 研究データ 論文 本 博士論文 プロジェクト \nImproving cache performance of dynamic applications with computation and data layout \ntransformations 被引用文献2件 DING C. 収録刊行物 Proc. SIGPLAN'99 Conference on \nProgramming Language Design and Implementation, Atlanta Proc. SIGPLAN'99 Conference on …",
    "url": "https://cir.nii.ac.jp/crid/1571417124791304704",
    "pub_year": 1999
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "Locality phase prediction",
    "abstract": "As computer memory hierarchy becomes adaptive, its performance increasingly depends on forecasting the dynamic program locality. This paper presents a method that predicts the locality phases of a program by a combination of locality profiling and run-time prediction. By profiling a training input, it identifies locality phases by sifting through all accesses to all data elements using variable-distance sampling, wavelet filtering, and optimal phase partitioning. It then constructs a phase hierarchy through grammar compression. Finally, it inserts phase markers into the program using binary rewriting. When the instrumented program runs, it uses the first few executions of a phase to predict all its later executions.Compared with existing methods based on program code and execution intervals, locality phase prediction is unique because it uses locality profiles, and it marks phase boundaries in program code. The …",
    "url": "https://dl.acm.org/doi/abs/10.1145/1037187.1024414",
    "pub_year": 2004
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "Software behavior oriented parallelization",
    "abstract": "Many sequential applications are difficult to parallelize because of unpredictable control flow, indirect data access, and input-dependent parallelism. These difficulties led us to build a software system for behavior oriented parallelization (BOP), which allows a program to be parallelized based on partial information about program behavior, for example, a user reading just part of the source code, or a profiling tool examining merely one or few executions.The basis of BOP is programmable software speculation, where a user or an analysis tool marks possibly parallel regions in the code, and the run-time system executes these regions speculatively. It is imperative to protect the entire address space during speculation. The main goal of the paper is to demonstrate that the general protection can be made cost effective by three novel techniques: programmable speculation, critical-path minimization, and value-based …",
    "url": "https://dl.acm.org/doi/abs/10.1145/1273442.1250760",
    "pub_year": 2007
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "Program locality analysis using reuse distance",
    "abstract": "On modern computer systems, the memory performance of an application depends on its locality. For a single execution, locality-correlated measures like average miss rate or working-set size have long been analyzed using reuse distance—the number of distinct locations accessed between consecutive accesses to a given location. This article addresses the analysis problem at the program level, where the size of data and the locality of execution may change significantly depending on the input.The article presents two techniques that predict how the locality of a program changes with its input. The first is approximate reuse-distance measurement, which is asymptotically faster than exact methods while providing a guaranteed precision. The second is statistical prediction of locality in all executions of a program based on the analysis of a few executions. The prediction process has three steps: dividing data …",
    "url": "https://dl.acm.org/doi/abs/10.1145/1552309.1552310",
    "pub_year": 2009
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "Array regrouping and structure splitting using whole-program reference affinity",
    "abstract": "While the memory of most machines is organized as a hierarchy, program data are laid out in a uniform address space. This paper defines a model of reference affinity, which measures how close a group of data are accessed together in a reference trace. It proves that the model gives a hierarchical partition of program data. At the top is the set of all data with the weakest affinity. At the bottom is each data element with the strongest affinity. Based on the theoretical model, the paper presents k-distance analysis, a practical test for the hierarchical affinity of source-level data. When used for array regrouping and structure splitting, k-distance analysis consistently outperforms data organizations given by the programmer, compiler analysis, frequency profiling, statistical clustering, and all other methods we have tried.",
    "url": "https://dl.acm.org/doi/abs/10.1145/996893.996872",
    "pub_year": 2004
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "HOTL: a higher order theory of locality",
    "abstract": "The locality metrics are many, for example, miss ratio to test performance, data footprint to manage cache sharing, and reuse distance to analyze and optimize a program. It is unclear how different metrics are related, whether one subsumes another, and what combination may represent locality completely.This paper first derives a set of formulas to convert between five locality metrics and gives the condition for correctness. The transformation is analogous to differentiation and integration used to convert between higher order polynomials. As a result, these metrics can be assigned an order and organized into a hierarchy.Using the new theory, the paper then develops two techniques: one measures the locality in real time without special hardware support, and the other predicts multicore cache interference without parallel testing. The paper evaluates them using sequential and parallel programs as well as for a …",
    "url": "https://dl.acm.org/doi/abs/10.1145/2451116.2451153",
    "pub_year": 2013
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "Improving effective bandwidth through compiler enhancement of global cache reuse",
    "abstract": "The performance of modern machines is increasingly limited by insufficient memory bandwidth. One way to alleviate this bandwidth limitation for a given program is to minimize the aggregate data volume the program transfers from memory. In this article we present compiler strategies for accomplishing this minimization. Following a discussion of the underlying causes of bandwidth limitations, we present a two-step strategy to exploit global cache reuse—the temporal reuse across the whole program and the spatial reuse across the entire data set used in that program. In the first step, we fuse computation on the same data using a technique called reuse-based loop fusion to integrate loops with different control structures. We prove that optimal fusion for bandwidth is NP-hard and we explore the limitations of computation fusion using perfect program information. In the second step, we group data used by the same …",
    "url": "https://www.sciencedirect.com/science/article/pii/S0743731503001710",
    "pub_year": 2004
  },
  {
    "author": {
      "first": "Chen",
      "last": "Ding",
      "middle": "",
      "department": "cs",
      "website": "https://www.cs.rochester.edu/people/faculty/ding_chen/index.html"
    },
    "title": "{LAMA}: Optimized locality-aware memory allocation for key-value cache",
    "abstract": "The in-memory cache system is a performance-critical layer in today’s web server architecture. Memcached is one of the most effective, representative, and prevalent among such systems. An important problem is memory allocation. The default design does not make the best use of the memory. It fails to adapt when the demand changes, a problem known as slab calcification.",
    "url": "https://www.usenix.org/conference/atc15/technical-session/presentation/hu",
    "pub_year": 2015
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Audio-visual event localization in unconstrained videos",
    "abstract": "In this paper, we introduce a novel problem of audio-visual event localization in unconstrained videos. We define an audio-visual event as an event that is both visible and audible in a video segment. We collect an Audio-Visual Event (AVE) dataset to systemically investigate three temporal localization tasks: supervised and weakly-supervised audio-visual event localization, and cross-modality localization. We develop an audio-guided visual attention mechanism to explore audio-visual correlations, propose a dual multimodal residual network (DMRN) to fuse information over the two modalities, and introduce an audio-visual distance learning network to handle the cross-modality localization. Our experiments support the following findings: joint modeling of auditory and visual modalities outperforms independent modeling, the learned attention can capture semantics of sounding objects, temporal alignment is important for audio-visual fusion, the proposed DMRN is effective in fusing audio-visual features, and strong correlations between the two modalities enable cross-modality localization.",
    "url": "http://openaccess.thecvf.com/content_ECCV_2018/html/Yapeng_Tian_Audio-Visual_Event_Localization_ECCV_2018_paper.html",
    "pub_year": 2018
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Hierarchical cross-modal talking face generation with dynamic pixel-wise loss",
    "abstract": "We devise a cascade GAN approach to generate talking face video, which is robust to different face shapes, view angles, facial characteristics, and noisy audio conditions. Instead of learning a direct mapping from audio to video frames, we propose first to transfer audio to high-level structure, ie, the facial landmarks, and then to generate video frames conditioned on the landmarks. Compared to a direct audio-to-image approach, our cascade approach avoids fitting spurious correlations between audiovisual signals that are irrelevant to the speech content. We, humans, are sensitive to temporal discontinuities and subtle artifacts in video. To avoid those pixel jittering problems and to enforce the network to focus on audiovisual-correlated regions, we propose a novel dynamically adjustable pixel-wise loss with an attention mechanism. Furthermore, to generate a sharper image with well-synchronized facial movements, we propose a novel regression-based discriminator structure, which considers sequence-level information along with frame-level information. Thoughtful experiments on several datasets and real-world samples demonstrate significantly better results obtained by our method than the state-of-the-art methods in both quantitative and qualitative comparisons.",
    "url": "http://openaccess.thecvf.com/content_CVPR_2019/html/Chen_Hierarchical_Cross-Modal_Talking_Face_Generation_With_Dynamic_Pixel-Wise_Loss_CVPR_2019_paper.html",
    "pub_year": 2019
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Automatic Music Transcription: An Overview",
    "abstract": "The capability of transcribing music audio into music notation is a fascinating example of human intelligence. It involves perception (analyzing complex auditory scenes), cognition (recognizing musical objects), knowledge representation (forming musical structures), and inference (testing alternative hypotheses). Automatic music transcription (AMT), i.e., the design of computational algorithms to convert acoustic music signals into some form of music notation, is a challenging task in signal processing and artificial intelligence. It comprises several subtasks, including multipitch estimation (MPE), onset and offset detection, instrument recognition, beat and rhythm tracking, interpretation of expressive timing and dynamics, and score typesetting.",
    "url": "https://ieeexplore.ieee.org/abstract/document/8588423/",
    "pub_year": 2018
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Lip movements generation at a glance",
    "abstract": "Cross-modality generation is an emerging topic that aims to synthesize data in one modality based on information in a different modality. In this paper, we consider a task of such: given an arbitrary audio speech and one lip image of arbitrary target identity, generate synthesized lip movements of the target identity saying the speech. To perform well in this task, it inevitably requires a model to not only consider the retention of target identity, photo-realistic of synthesized images, consistency and smoothness of lip images in a sequence, but more importantly, learn the correlations between audio speech and lip movements. To solve the collective problems, we explore the best modeling of the audio-visual correlations in building and training a lip-movement generator network. Specifically, we devise a method to fuse audio and image embeddings to generate multiple lip images at once and propose a novel correlation loss to synchronize lip changes and speech changes. Our final model utilizes a combination of four losses for a comprehensive consideration in generating lip movements; it is trained in an end-to-end fashion and is robust to lip shapes, view angles and different facial characteristics. Thoughtful experiments on three datasets ranging from lab-recorded to lips in the wild show that our model significantly outperforms other state-of-the-art methods extended to this task.",
    "url": "http://openaccess.thecvf.com/content_ECCV_2018/html/Lele_Chen_Lip_Movements_Generation_ECCV_2018_paper.html",
    "pub_year": 2018
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Deep Cross-Modal Audio-Visual Generation",
    "abstract": "Cross-modal audio-visual perception has been a long-lasting topic in psychology and neurology, and various studies have discovered strong correlations in human perception of auditory and visual stimuli. Despite work on computational multimodal modeling, the problem of cross-modal audio-visual generation has not been systematically studied in the literature. In this paper, we make the first attempt to solve this cross-modal generation problem leveraging the power of deep generative adversarial training. Specifically, we use conditional generative adversarial networks to achieve cross-modal audio-visual generation of musical performances. We explore different encoding methods for audio and visual signals, and work on two scenarios: instrument-oriented generation and pose-oriented generation. Being the first to explore this new problem, we compose two new datasets with pairs of images and sounds of …",
    "url": "https://dl.acm.org/doi/abs/10.1145/3126686.3126723",
    "pub_year": 2017
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Multiple fundamental frequency estimation by modeling spectral peaks and non-peak regions",
    "abstract": "This paper presents a maximum-likelihood approach to multiple fundamental frequency (F0) estimation for a mixture of harmonic sound sources, where the power spectrum of a time frame is the observation and the F0s are the parameters to be estimated. When defining the likelihood model, the proposed method models both spectral peaks and non-peak regions (frequencies further than a musical quarter tone from all observed peaks). It is shown that the peak likelihood and the non-peak region likelihood act as a complementary pair. The former helps find F0s that have harmonics that explain peaks, while the latter helps avoid F0s that have harmonics in non-peak regions. Parameters of these models are learned from monophonic and polyphonic training data. This paper proposes an iterative greedy search strategy to estimate F0s one by one, to avoid the combinatorial problem of concurrent F0 estimation. It also …",
    "url": "https://ieeexplore.ieee.org/abstract/document/5404324/",
    "pub_year": 2010
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "One-class learning towards synthetic voice spoofing detection",
    "abstract": "Human voices can be used to authenticate the identity of the speaker, but the automatic speaker verification (ASV) systems are vulnerable to voice spoofing attacks, such as impersonation, replay, text-to-speech, and voice conversion. Recently, researchers developed anti-spoofing techniques to improve the reliability of ASV systems against spoofing attacks. However, most methods encounter difficulties in detecting unknown attacks in practical use, which often have different statistical distributions from known attacks. Especially, the fast development of synthetic voice spoofing algorithms is generating increasingly powerful attacks, putting the ASV systems at risk of unseen attacks. In this work, we propose an anti-spoofing system to detect unknown synthetic voice spoofing attacks (i.e., text-to-speech or voice conversion) using one-class learning. The key idea is to compact the bona fide speech representation and …",
    "url": "https://ieeexplore.ieee.org/abstract/document/9417604/",
    "pub_year": 2021
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Creating a Multitrack Classical Music Performance Dataset for Multimodal Music Analysis: Challenges, Insights, and Applications",
    "abstract": "We introduce a dataset for facilitating audio-visual analysis of music performances. The dataset comprises 44 simple multi-instrument classical music pieces assembled from coordinated but separately recorded performances of individual tracks. For each piece, we provide the musical score in MIDI format, the audio recordings of the individual tracks, the audio and video recording of the assembled mixture, and ground-truth annotation files including frame-level and note-level transcriptions. We describe our methodology for the creation of the dataset, particularly highlighting our approaches to address the challenges involved in maintaining synchronization and expressiveness. We demonstrate the high quality of synchronization achieved with our proposed approach by comparing the dataset with existing widely used music audio datasets. We anticipate that the dataset will be useful for the development and …",
    "url": "https://ieeexplore.ieee.org/abstract/document/8411155/",
    "pub_year": 2018
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Creating a Multitrack Classical Music Performance Dataset for Multimodal Music Analysis: Challenges, Insights, and Applications",
    "abstract": "We introduce a dataset for facilitating audio-visual analysis of music performances. The dataset comprises 44 simple multi-instrument classical music pieces assembled from coordinated but separately recorded performances of individual tracks. For each piece, we provide the musical score in MIDI format, the audio recordings of the individual tracks, the audio and video recording of the assembled mixture, and ground-truth annotation files including frame-level and note-level transcriptions. We describe our methodology for the creation of the dataset, particularly highlighting our approaches to address the challenges involved in maintaining synchronization and expressiveness. We demonstrate the high quality of synchronization achieved with our proposed approach by comparing the dataset with existing widely used music audio datasets. We anticipate that the dataset will be useful for the development and …",
    "url": "https://ieeexplore.ieee.org/abstract/document/8411155/",
    "pub_year": 2018
  },
  {
    "author": {
      "first": "Zhiyao",
      "last": "Duan",
      "middle": "",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/duan_zhiyao/index.html"
    },
    "title": "Soundprism: An online system for score-informed source separation of music audio",
    "abstract": "Soundprism, as proposed in this paper, is a computer system that separates single-channel polyphonic music audio played by harmonic sources into source signals in an online fashion. It uses a musical score to guide the separation process. To the best of our knowledge, this is the first online system that addresses score-informed music source separation that can be made into a real-time system. The proposed system consists of two parts: 1) a score follower that associates a score position to each time frame of the audio performance; 2) a source separator which reconstructs the source signals for each time frame, informed by the score. The score follower uses a hidden Markov approach, where each audio frame is associated with a 2-D state vector (score position and tempo). The observation model is defined as the likelihood of observing the frame given the pitches at the score position. The score position and …",
    "url": "https://ieeexplore.ieee.org/abstract/document/5887382/",
    "pub_year": 2011
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "AWB-GCN: A graph convolutional network accelerator with runtime workload rebalancing",
    "abstract": "Deep learning systems have been successfully applied to Euclidean data such as images, video, and audio. In many applications, however, information and their relationships are better expressed with graphs. Graph Convolutional Networks (GCNs) appear to be a promising approach to efficiently learn from graph data structures, having shown advantages in many critical applications. As with other deep learning modalities, hardware acceleration is critical. The challenge is that real-world graphs are often extremely large and unbalanced; this poses significant performance demands and design challenges. In this paper, we propose Autotuning-Workload-Balancing GCN (AWB-GCN) to accelerate GCN inference. To address the issue of workload imbalance in processing real-world graphs, three hardware-based autotuning techniques are proposed: dynamic distribution smoothing, remote switching, and row …",
    "url": "https://ieeexplore.ieee.org/abstract/document/9252000/",
    "pub_year": 2020
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "FPDeep: Acceleration and load balancing of CNN training on FPGA clusters",
    "abstract": "FPGA-based CNN accelerators have advantages in flexibility and power efficiency and so are being deployed by a number of cloud computing service providers, including Microsoft, Amazon, Tencent, and Alibaba. Given the increasing complexity of neural networks, however, it is becoming challenging to efficiently map CNNs to multi-FPGA platforms. In this work, we present a scalable framework, FPDeep, which helps engineers map a specific CNN's training logic to a multi-FPGA cluster or cloud and to build RTL implementations for the target network. With FPDeep, multi-FPGA accelerators work in a deeply-pipelined manner using a simple 1-D topology; this enables the accelerators to map directly onto many existing platforms, including Catapult, Catapult2, and almost any tightly-coupled FPGA cluster. FPDeep uses two mechanisms to facilitate high-performance and energy-efficiency. First, FPDeep provides a …",
    "url": "https://ieeexplore.ieee.org/abstract/document/8457636/",
    "pub_year": 2018
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "I-GCN: A graph convolutional network accelerator with runtime locality enhancement through islandization",
    "abstract": " Graph Convolutional Networks (GCNs) have drawn tremendous attention in the past three years. Compared with other deep learning modalities, high-performance hardware acceleration of GCNs is as critical but even more challenging. The hurdles arise from the poor data locality and redundant computation due to the large size, high sparsity, and irregular non-zero distribution of real-world graphs. In this paper we propose a novel hardware accelerator for GCN inference, called I-GCN, that significantly improves data locality and reduces unnecessary computation. The mechanism is a new online graph restructuring algorithm we refer to as islandization. The proposed algorithm finds clusters of nodes with strong internal but weak external connections. The islandization process yields two major benefits. First, by processing islands rather than individual nodes, there is better on-chip data reuse and fewer off-chip …",
    "url": "https://dl.acm.org/doi/abs/10.1145/3466752.3480113",
    "pub_year": 2021
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "Accelerating Transformer-based Deep Learning Models on FPGAs using Column Balanced Block Pruning",
    "abstract": "Although Transformer-based language representations achieve state-of-the-art accuracy on various natural language processing (NLP) tasks, the large model size has been challenging the resource constrained computing platforms. Weight pruning, as a popular and effective technique in reducing the number of weight parameters and accelerating the Transformer, has been investigated on GPUs. However, the Transformer acceleration using weight pruning on field-programmable gate array (FPGAs) remains unexplored. This paper investigates the column balanced block-wise pruning on Transformer and designs an FPGA acceleration engine to customize the balanced blockwise matrix multiplication. We implement the Transformer model with proper hardware scheduling, and the experiments show that the Transformer inference on FPGA achieves 10.35 ms latency with the batch size of 32, which is 10.96 …",
    "url": "https://ieeexplore.ieee.org/abstract/document/9424344/",
    "pub_year": 2021
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "A framework for acceleration of CNN training on deeply-pipelined FPGA clusters with work and weight load balancing",
    "abstract": "To improve flexibility and energy efficiency of Convolutional Neural Networks, a number of cloud computing service providers-including Microsoft, Amazon, and Alibaba-are using FPGA-based CNN accelerators. However, the growing size and complexity of neural networks, coupled with communication and off-chip memory bottlenecks, make it increasingly difficult for multi-FPGA designs to achieve high resource utilization and performance, especially when training. In this work, we present new results for a scalable framework, FPDeep, which helps users efficiently map CNN training logic to multiple FPGAs and automatically generates the resulting RTL implementation. FPDeep is equipped with two mechanisms to facilitate high-performance and energy-efficient training. First, FPDeep improves DSP slice utilization across FPGAs by balancing workload using dedicated partition and mapping strategies. Second, only …",
    "url": "https://ieeexplore.ieee.org/abstract/document/8533530/",
    "pub_year": 2018
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "FPDeep: Scalable Acceleration of CNN Training on Deeply-Pipelined FPGA Clusters",
    "abstract": "Deep convolutional Neural Networks (CNNs) have revolutionized numerous applications, but the demand for ever more performance remains unabated. Scaling CNN computations to larger clusters is generally done by distributing tasks in batch mode using methods such as distributed synchronous SGD. Among the issues with this approach is that, to make the distributed cluster work with high utilization, the workload distributed to each node must be large; this implies nontrivial growth in the SGD mini-batch size. In this article we propose a framework, called FPDeep, which uses a hybrid of model and layer parallelism to configure distributed reconfigurable clusters to train CNNs. This approach has numerous benefits. First, the design does not suffer from performance loss due to batch size growth. Second, work and storage are balanced among nodes through novel workload and weight partitioning schemes. Part …",
    "url": "https://ieeexplore.ieee.org/abstract/document/9110747/",
    "pub_year": 2020
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "Fully integrated FPGA molecular dynamics simulations",
    "abstract": "The implementation of Molecular Dynamics (MD) on FPGAs has received substantial attention. Previous work, however, has consisted of either proof-of-concept implementations of components, usually the range-limited force; full systems, but with much of the work shared by the host CPU; or prototype demonstrations, e.g., using OpenCL, that neither implement a whole system nor have competitive performance. In this paper, we present what we believe to be the first full-scale FPGA-based simulation engine, and show that its performance is competitive with a GPU (running Amber in an industrial production environment). The system features on-chip particle data storage and management, short- and long-range force evaluation, as well as bonded forces, motion update, and particle migration. Other contributions of this work include exploring numerous architectural trade-offs and analysis of various mappings …",
    "url": "https://dl.acm.org/doi/abs/10.1145/3295500.3356179",
    "pub_year": 2019
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "LP-BNN: Ultra-low-latency BNN inference with layer parallelism",
    "abstract": "High inference latency seriously limits the deployment of DNNs in real-time domains such as autonomous driving, robotic control, and many others. To address this emerging challenge, researchers have proposed approximate DNNs with reduced precision, e.g., Binarized Neural Networks (BNNs). While BNNs can be built to have little loss in accuracy, latency reduction still has much room for improvement. In this paper, we propose a single-FPGA-based BNN accelerator that achieves microsecond-level ultra-low-latency inference of ImageNet, LP-BNN. We obtain this performance via several design optimizations. First, we optimize the network structure by removing Batch Normalization (BN) functions which leads to significant latency in BNNs without any loss on accuracy. Second, we propose a parameterized architecture which is based on layer parallelism and supports nearly perfect load balancing for various …",
    "url": "https://ieeexplore.ieee.org/abstract/document/8825103/",
    "pub_year": 2019
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "Tripartite feature enhanced pyramid network for dense prediction",
    "abstract": "Learning pyramidal feature representations is important for many dense prediction tasks (e.g., object detection, semantic segmentation) that demand multi-scale visual understanding. Feature Pyramid Network (FPN) is a well-known architecture for multi-scale feature learning, however, intrinsic weaknesses in feature extraction and fusion impede the production of informative features. This work addresses the weaknesses of FPN through a novel tripartite feature enhanced pyramid network (TFPN), with three distinct and effective designs. First, we develop a feature reference module with lateral connections to adaptively extract bottom-up features with richer details for feature pyramid construction. Second, we design a feature calibration module between adjacent layers that calibrates the upsampled features to be spatially aligned, allowing for feature fusion with accurate correspondences. Third, we introduce a …",
    "url": "https://ieeexplore.ieee.org/abstract/document/10121637/",
    "pub_year": 2023
  },
  {
    "author": {
      "first": "Tong",
      "last": "Geng",
      "middle": "(Tony)",
      "department": "cs",
      "website": "https://www.hajim.rochester.edu/ece/people/faculty/geng_tony/index.html"
    },
    "title": "A length adaptive algorithm-hardware co-design of transformer on fpga through sparse attention and dynamic pipelining",
    "abstract": "Transformers are considered one of the most important deep learning models since 2018, in part because it establishes state-of-the-art (SOTA) records and could potentially replace existing Deep Neural Networks (DNNs). Despite the remarkable triumphs, the prolonged turnaround time of Transformer models is a widely recognized roadblock. The variety of sequence lengths imposes additional computing overhead where inputs need to be zero-padded to the maximum sentence length in the batch to accommodate the parallel computing platforms. This paper targets the field-programmable gate array (FPGA) and proposes a coherent sequence length adaptive algorithm-hardware co-design for Transformer acceleration. Particularly, we develop a hardware-friendly sparse attention operator and a length-aware hardware resource scheduling algorithm. The proposed sparse attention operator brings the complexity of …",
    "url": "https://dl.acm.org/doi/abs/10.1145/3489517.3530585",
    "pub_year": 2022
  }
]